import { NativeDateService } from "@ui-kitten/components";

const i18n = {
  dayNames: {
    short: ["Пн", "Вт", "Ср", "Чт", "Пт", "Сб", "Вс"],
    long: [
      "Понедельник",
      "Вторник",
      "Среда",
      "Четверг",
      "Пятница",
      "Суббота",
      "Воскресенье",
    ],
  },
  monthNames: {
    short: [
      "Янв",
      "Февр",
      "Марта",
      "Фпр",
      "Мая",
      "Июня",
      "Июля",
      "Фвг",
      "Сент",
      "Окт",
      "Нояб",
      "Дек",
    ],
    long: [
      "января",
      "февраля",
      "марта",
      "апреля",
      "мая",
      "июня",
      "июля",
      "августа",
      "сентября",
      "октября",
      "ноября",
      "декабря",
    ],
  },
};

const dateService = new NativeDateService("ru", { i18n });

export { dateService, i18n };
